In [2]:
import pandas as pd
import numpy as np

In [4]:
s1 = np.random.randint(10, size =5)
s2 = np.random.randint(10, size =5)
s3 = np.random.randint(10, size =5)

In [5]:
sozluk = {"var1" : s1, "var2" : s2, "var3": s3}

In [6]:
sozluk

{'var1': array([0, 3, 1, 1, 7]),
 'var2': array([7, 0, 0, 6, 4]),
 'var3': array([8, 0, 3, 6, 1])}

In [8]:
df = pd.DataFrame(sozluk)

In [9]:
df

   var1  var2  var3
0     0     7     8
1     3     0     0
2     1     0     3
3     1     6     6
4     7     4     1

In [11]:
df[0:3]

   var1  var2  var3
0     0     7     8
1     3     0     0
2     1     0     3

In [16]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
df.index = ["a","b","c","d","e"]

In [18]:
df

   var1  var2  var3
a     0     7     8
b     3     0     0
c     1     0     3
d     1     6     6
e     7     4     1

In [20]:
#silme
df.drop("a", axis = 0)

   var1  var2  var3
b     3     0     0
c     1     0     3
d     1     6     6
e     7     4     1

In [22]:
df #anayapi degismedi

   var1  var2  var3
a     0     7     8
b     3     0     0
c     1     0     3
d     1     6     6
e     7     4     1

In [28]:
df.drop("b", axis = 0 , inplace = True)

In [29]:
df #tamamen degistirdi b degerini sildi

   var1  var2  var3
c     1     0     3
d     1     6     6
e     7     4     1

In [30]:
#fancy
l = ["c","e"]

In [31]:
df.drop(l ,axis = 0)

   var1  var2  var3
d     1     6     6

In [32]:
"var1" in df

True

In [33]:
l = ["var1","var4","var2"]

In [34]:
for i in l:
    print( i in df)

True
False
True

In [35]:
df

   var1  var2  var3
c     1     0     3
d     1     6     6
e     7     4     1

In [36]:
df["var4"] = df["var1"]/ df["var2"]

In [37]:
df

   var1  var2  var3      var4
c     1     0     3       inf
d     1     6     6  0.166667
e     7     4     1  1.750000

In [38]:
df.drop("var4", axis = 1)

   var1  var2  var3
c     1     0     3
d     1     6     6
e     7     4     1

In [39]:
df

   var1  var2  var3      var4
c     1     0     3       inf
d     1     6     6  0.166667
e     7     4     1  1.750000

In [40]:
df.drop("var4", axis= 1 , inplace = True)

In [41]:
df #degisti

   var1  var2  var3
c     1     0     3
d     1     6     6
e     7     4     1